app/models/user.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 5], ["created_at", "2022-09-21 11:08:12.494691"], ["updated_at", "2022-09-21 11:08:12.494691"]]
---
      def create_cart_for_user
        self.create_cart